app/views/students/edit.html.erb

SELECT "schools".* FROM "schools"
---
<%= f.number_field :age %>
<%= f.collection_select :school_id, School.all, :id, :name, prompt: true %>