app/views/students/new.html.erb

<%= f.number_field :age %>
<%= f.collection_select :school_id, School.all, :id, :name, prompt: true %>
---
SELECT "schools".* FROM "schools"