app/views/schools/show.html.erb

<h1><%=@school.name %></h1>
<p><% @school.students.each do |student|%></p>
---
SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 30]]