app/controllers/students_controller.rb

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("name", "age", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Michelle"], ["age", 23], ["school_id", 26], ["created_at", "2019-11-06 16:16:32.260173"], ["updated_at", "2019-11-06 16:16:32.260173"]]

  def show
    #show page looks for this & shows specific student through their id
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_id", 26], ["updated_at", "2019-11-06 16:37:26.887220"], ["id", 5]]

  def delete
    #finding student with that id then destroy & redirect to students index
    student = Student.find(params[:id])
    student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 6]]